[
  {
    "status": "Work In Progress",
    "title": "Wedstrijden scherm",
    "description": "Het wedstrijden scherm heeft nog heel wat problemen, er te snel door scrollen zorgt ervoor dat deze gek begint te doen en daardoor de app niet meer werkt.",
    "temp_solution": "Niet te veel teams, clubs of competities toevoegen aan je favoriete waardoor en minder data moet ingeladen worden. Of gewoon niet te snel scrollen 🤣"
  },
  {
    "status": "Opgelost",
    "title": "Favoriete Scherm Update",
    "description": "Wanneer je een club, team of competitie toegevoegd hebt of verwijderd hebt uit je favoriete wordt de data niet geupdate op het favoriete scherm.",
    "temp_solution": "Door de data te refreshen worden de favoriete nu direct bijgewerkt, maar elke 30 seconden wordt de pagina ook gefrereshed als er wijzigingen zijn"
  },
  {
    "status": "Opgelost",
    "title": "Favoriete Wedstrijden Update",
    "description": "Wanneer je een club, team of competitie toegevoegd hebt of verwijderd hebt uit je favoriete wordt de data niet geupdate op het wedstrijden scherm.",
    "temp_solution": "Er zal op het scherm getoond worden om de app te herladen als de favoriete gewijzigd zijn, de app is nog volledig te gebruiken maar de data is niet up to date."
  },
  {
    "status": "Testen, lijkt opgelost",
    "title": "Data updates",
    "description": "Getoonde data wordt niet altijd geupdate wanneer je de pagina herlaad (Hangt samen met de favoriete updates)."
  },
  {
    "status": "Work In Progress",
    "title": "Geen data",
    "description": "Nog niet bij alle componenten is er een extra component toegevoegd zal worden als er geen data beschikbaar is om weer te geven waardoor er foutmeldingen kunnen verschijnen."
  },
  {
    "status": "Opgelost",
    "title": "Wedstrijd opent automatisch",
    "description": "Bij het scrollen door de wedstrijden op de start pagina, opent er soms een wedstrijd.",
    "temp_solution": "Door te scroll op het component dat de datum weergeeft wordt het wedstrijd component niet geactiveerd."
  },
  {
    "status": "Afwachtend",
    "title": "Favoriet icoontje half uit beeld",
    "description": "Soms gebeurd het dat het icoontje van favoriet bij een club, team of competitie maar een stuk in beeld is en er niet opgeklikt kan worden.",
    "temp_solution": "Door later eens opnieuw te proberen of via een andere plek verschijnt het icoontje soms wel"
  }
]
